//*****************************************************************************
//   二重定義防止
//*****************************************************************************
#ifndef _3D_SAMPLE_H_
#define _3D_SAMPLE_H_

//*****************************************************************************
//   クラスの定義
//*****************************************************************************
// シーンクラス
class C3D_sample : public CScene3D
{
public:
	C3D_sample();             // デフォルトコンストラクタ
	~C3D_sample();                             // デストラクタ
	
	void Init(void);        // 初期化処理
	void Uninit(void);      // 終了処理
	void Update(void);      // 更新処理
	void Draw(void);        // 描画処理

	static C3D_sample *Create(void);                  // 作成
};

#endif