//*****************************************************************************
//   二重定義防止
//*****************************************************************************
#ifndef _BI_SAMPLE_H_
#define _BI_SAMPLE_H_

//*****************************************************************************
//   クラスの定義
//*****************************************************************************
// シーンクラス
class CBI_sample : public CSceneBillboard
{
public:
	CBI_sample();             // デフォルトコンストラクタ
	~CBI_sample();                             // デストラクタ
	
	void Init(void);        // 初期化処理
	void Uninit(void);      // 終了処理
	void Update(void);      // 更新処理
	void Draw(void);        // 描画処理

	static CBI_sample *Create(void);                  // 作成
};

#endif