//*****************************************************************************
//   二重定義防止
//*****************************************************************************
#ifndef _SCENE3D_H_
#define _SCENE3D_H_

//*****************************************************************************
//   クラスの定義
//*****************************************************************************
// シーンクラス
class CScene3D : public CScene
{
public:
	CScene3D(int nPriority = 3);                                   // デフォルトコンストラクタ
	~CScene3D();                                  // デストラクタ
	
	void Init(void);                              // 初期化処理
	void Uninit(void);                            // 終了処理
	void Update(void);                            // 更新処理
	void Draw(void);                              // 描画処理
	
protected:
	float fRot;

private:
	void MakeVex(void);     // 頂点の設定
};

#endif